In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
# Files to load
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [4]:
# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head(100)

              city  driver_count      type
0      Richardfort            38     Urban
1     Williamsstad            59     Urban
2      Port Angela            67     Urban
3       Rodneyfort            34     Urban
4      West Robert            39     Urban
..             ...           ...       ...
95       Lewisland             4  Suburban
96      Josephside            25  Suburban
97       Davidfurt            23  Suburban
98   Nicolechester            19  Suburban
99  East Aaronbury             7  Suburban

[100 rows x 3 columns]

In [5]:
# Read the ride data file and store it in a pandas DataFrame.
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(100)

                  city                 date   fare        ride_id
0   Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1   South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2   Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3           Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4           South Jack  2019-03-06 04:28:35  34.58  3908451377344
..                 ...                  ...    ...            ...
95        Williamsstad  2019-03-29 21:43:04  35.58  4747780858464
96         North Jason  2019-03-08 20:06:21  25.21  3180078116241
97     Christopherfurt  2019-04-17 02:25:49  23.30  7819057680096
98            Liumouth  2019-01-11 17:15:17  36.78  1464517778842
99             Johnton  2019-01-17 02:12:01  32.19  8526302845313

[100 rows x 4 columns]

In [6]:
# Get the columns and the rows that are not null.
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [7]:
# Get the columns and the rows that are not null.
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [8]:
# Get the data types of each column.
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [9]:
# Get the unique values of the type of city.
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [17]:
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Urban")

66

In [18]:
# Get the number of data points from the Rural cities.
sum(city_data_df["type"]=="Rural")

18

In [19]:
# Get the columns and the rows that are not null.
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [20]:
# Get the columns and the rows that are not null.
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [21]:
# Get the data types of each column.
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [22]:
# Combine the data into a single dataset
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])

# Display the DataFrame
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban